src/cf/InformationRegisters/НастройкаЗаполненияСвободныхСтрокФормСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкаЗаполненияСвободныхСтрокФормСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтатистическогоНаблюдения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияОбъектаНаблюдения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовЭкономическойДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПродукцииПоВидамДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУслугНаселению</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкаЗаполненияСвободныхСтрокФормСтатистики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверяет есть ли записи в регистре, по заданному отбору.
// Параметры:
//	Отбор - Структура - Отбор по которому нужно искать записи.
//	 * Организация - СправочникСсылка.Организации - Организация для которой нужно определить наличие настройки.
//	 * ОбъектНаблюдения - СправочникСсылка.ОбъектыСтатистическогоНаблюдения - 
//		Объект наблюдения для которого нужно определить наличие настройки.
// Возвращаемое значение:
//	Булево - истина - записи есть, Ложь - Записей нет.
//
Функция ЕстьЗаписи(Отбор) Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкаЗаполненияСвободныхСтрокФормСтатистики.Организация
	|ИЗ
	|	РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики КАК НастройкаЗаполненияСвободныхСтрокФормСтатистики
	|{ГДЕ
	|	НастройкаЗаполненияСвободныхСтрокФормСтатистики.Организация КАК Организация,
	|	НастройкаЗаполненияСвободныхСтрокФормСтатистики.ОбъектНаблюдения КАК ОбъектНаблюдения,
	|	НастройкаЗаполненияСвободныхСтрокФормСтатистики.ДетализацияОбъектаНаблюдения КАК ДетализацияОбъектаНаблюдения}";
	
	Для Каждого КлючИЗначение Из Отбор Цикл
		ЭлементОтбора = Запрос.Отбор.Добавить(КлючИЗначение.Ключ);
		ЭлементОтбора.Установить(КлючИЗначение.Значение);
	КонецЦикла;
	
	Запрос.Выполнить();
	Возврат Не Запрос.Результат.Пустой();
	
КонецФункции

#КонецЕсли
